content/books/how_to_read_a_book.md
+++
title = "How to read a book"
date = 2019-12-01
tags = ["book"]
draft = false
+++

## Summary {#summary}

> How to Read a Book, originally published in 1940, has become a rare phenomenon, a living classic. It is the best and most successful guide to reading comprehension for the general reader. And now it has been completely rewritten and updated. You are told about the various levels of reading and how to achieve them -- from elementary reading, through systematic skimming and inspectional reading, to speed reading, you learn how to pigeonhole a book, X-ray it, extract the author's message, criticize. You are taught the different reading techniques for reading practical books, imaginative literature, plays, poetry, history, science and mathematics, philosophy and social science. Finally, the authors offer a recommended reading list and supply reading tests whereby you can measure your own progress in reading skills, comprehension and speed. -- [Source](https://www.goodreads.com/book/show/567610.How%5Fto%5FRead%5Fa%5FBook)


## Phases {#phases}


### Be a demanding reader {#be-a-demanding-reader}

-   List all arguments


### Inspecational reading {#inspecational-reading}


#### Skim the book as a whole {#skim-the-book-as-a-whole}

-   Read title and preface
-   Read table of contents
-   Check index
-   Read blurb
-   Look at the main chapters
-   Skim the book
    -   Choose some passages to read
    -   Superficial reading


### Analytical reading {#analytical-reading}

-   Ask 4 questions
    -   What is the book about?
    -   What is being said in detail and how?
    -   Is the book true, in whole or part?


### Syntopical reading {#syntopical-reading}

-   Has 3 stages
    -   Classify the book
        -   Understand aim and structure
            -   Theoretical
            -   Practical
        -   Know the book type you're reading
        -   State essence of whole book in one or more sentences
        -   Show how book is organized as a whole (outline the book)
            -   Get basic structure
        -   Find out what authors problems were
    -   Related to **how** (how the author has attempted to solve the problem)
        -   4 stages
            -   Come to terms with the author by interpreting his key words
                -   Know difference between words and terms
                -   Read words in context
            -   Grasp authors leading propositions by checking with most important sentences
            -   Know authors arguments
            -   Determine which of his problems the author has solved and which not
    -   Apply critical senses and begin to agree/disagree with the author
        -   Apply critical senses (but still following certain etiquette)
        -   Do not begin criticism until one has completed the book and did interpretation
        -   Do not disagree disputatiously and contentiosly
        -   Demonstrate one knows difference between knowledge and mere personal opinion by presenting good arguments
    -   Basic ideas
        -   Research books about one topic
        -   Cross-reference between resources
        -   Steps
            -   Inspecational reading
                -   Chose pages with most relevant content
            -   Establish neutral terminology
            -   Analyse discussion by ordering issues to throw mere light on the subject
